app/views/maps/index.html.erb

SELECT "maps".* FROM "maps"
---
<script>
  $(document).ready(function(){
    handler = Gmaps.build('Google');
    handler.buildMap({ internal: {id: 'sidebar_builder'}}, function(){
      var json_maps = [
        <% @maps.each do |map| %>
            { lat: <%= map.lat %>,
              lng: <%= map.lng %>,
              infowindow: "<%= map.info %>",
            },
        <% end %>
      ];
      json_target = json_maps;
      // Event Handler
      // Reference: https://github.com/apneadiving/Google-Maps-for-Rails/issues/474
      var markers = [];
      var eventList = []
      for (var i = 0; i < json_target.length; i++){
        var marker = handler.addMarker(json_target[i]);
        markers.push(marker);
        eventList[i] = google.maps.event.addListener(marker.serviceObject, 'click', function(e) {
          console.log(this.title); // the marker instance