app/controllers/maps_controller.rb

SELECT "maps".* FROM "maps"
---
  def index
    @maps = Map.all

INSERT INTO "maps" ("info", "lat", "lng", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["info", "Test"], ["lat", 49.13196996352492], ["lng", -122.83917534179687], ["created_at", "2016-09-18 14:12:09.916279"], ["updated_at", "2016-09-18 14:12:09.916279"]]
---
  def create
    @map = Map.new(map_params)
    if @map.save